In [4]:
res = {'ENM=modelenm,SubNetwork=QLD_METRO,MeContext=QLD_WNCU35_WOOLLOONGABBA_NC_TEST_BASE_571901,ManagedElement=QLD_WNCU35_WOOLLOONGABBA_NC_TEST_BASE_571901,ENodeBFunction=1,EUtranCellFDD=WNCUFT1,EUtranFreqRelation=1300,EUtranCellRelation=5051-579901-13': {'isRemoveAllowed': False, 'sCellCandidate': 1, 'sCellPriority': 7, 'coverageIndicator': 0, 'adjacentCell': 'ENM=modelenm,SubNetwork=QLD_Woolloongabba_Mod,MeContext=QLD_WNCU15_WOOLLOONGABBA_NC_TEST_BASE_579901,ManagedElement=1,ENodeBFunction=1,EUtranCellFDD=WNCUET3'}}

print(type(res))
res

<class 'dict'>

{'ENM=modelenm,SubNetwork=QLD_METRO,MeContext=QLD_WNCU35_WOOLLOONGABBA_NC_TEST_BASE_571901,ManagedElement=QLD_WNCU35_WOOLLOONGABBA_NC_TEST_BASE_571901,ENodeBFunction=1,EUtranCellFDD=WNCUFT1,EUtranFreqRelation=1300,EUtranCellRelation=5051-579901-13': {'isRemoveAllowed': False,
  'sCellCandidate': 1,
  'sCellPriority': 7,
  'coverageIndicator': 0,
  'adjacentCell': 'ENM=modelenm,SubNetwork=QLD_Woolloongabba_Mod,MeContext=QLD_WNCU15_WOOLLOONGABBA_NC_TEST_BASE_579901,ManagedElement=1,ENodeBFunction=1,EUtranCellFDD=WNCUET3'}}

In [1]:
string_value = 'I like to sort'
string_value

'I like to sort'

In [2]:
sorted_string = sorted(string_value.split())
sorted_string

['I', 'like', 'sort', 'to']

In [3]:
" ".join(sorted_string)

'I like sort to'

In [4]:
similar_values = [False, 0, 1, 'A' == 'B', 1 <= 0]
sorted(similar_values)

[False, 0, False, False, 1]

In [1]:
string_value = 'I like to sort'
sorted_string = sorted(string_value)
sorted_string

[' ', ' ', ' ', 'I', 'e', 'i', 'k', 'l', 'o', 'o', 'r', 's', 't', 't']

In [3]:
' '.join(sorted(string_value.split()))

'I like sort to'

In [2]:
num = [1349, 6587,9001, 7892 ]
num[0]

1349

In [3]:
str(num[0])

'1349'

In [4]:
str(num[0])[-1]

'9'

In [6]:
num = [1349, 6587,9001, 7892 ]
sorted(num,key = lambda x: int(str(x)[-1]))

[9001, 7892, 6587, 1349]

In [7]:
num = [1349, 6587,9001, 7892 ]
sorted(num,key = lambda x: int(str(x)[-1]), reverse =True)

[1349, 6587, 7892, 9001]

In [2]:
#What do you know about palindromes? Can you implement one in Python?
#A palindrome is a phrase, a word, or a sequence that reads the same 
#forward and backward. One such example will be pip! An example of such a phrase will be ‘nurses run’.

def IsPalindrome(string):
    left,right = 0, len(string)-1
    while right >=left:
        if not string[left]== string[right]:
            return False
        left += 1
        right -= 1
        return True

IsPalindrome('MOM')

True

In [4]:
#Using Iterator

def IsPalindrome(string):
    left,right = iter(string),iter(string[::-1])
    i = 0
    while i< len(string)/2:
        if next(left)!=next(right):
            return False
        i += 1
        return True

IsPalindrome("nurses run")

True

In [5]:
#*args : In cases when we don’t know how many arguments will be passed to a function,
#like when we want to pass a list or a tuple of values, we use *args.

def func(*args):
    for i in args:
        print(i)

func(1,2,3,4)

1
2
3
4

In [6]:
#**kwargs takes keyword arguments when we don’t know how many there will be.

def func(**kwargs):
    for i in kwargs:
        print(i, kwargs[i])

func(a=1,b=2,c=7)

a 1
b 2
c 7

In [8]:
def A(x):
   def B():
       print(x)
   return B

A(7)()

7

In [6]:
import random
import os
#os.getcwd()

#print(os.listdir())
lines = open('test.txt').read().splitlines()
random.choice(lines)

"IsPalindrome('MOM')"

In [8]:
try:
    with open('test1.txt','r') as f:
        print(f.read())
except IOError:
    print("file now found")

file now found

In [12]:
try:
    with open("test.txt","r") as f:
        count = 0
        for i in f.read():
            if i.isupper():
                count+=1
            
        print(count)
except IOError:
    print("File not Found")

15

In [1]:
nums=[1,2,5,10,3,100,9,24]
    
newnums = []

for i in nums:
    if i >= 5:
        newnums.append(i)
print(newnums)

[10, 100, 9, 24]

In [3]:
nums=[1,2,5,10,3,100,9,24]
newnums = [i for i in nums if i >=5]
newnums

[5, 10, 100, 9, 24]

In [5]:
nums=[1,2,5,10,3,100,9,24]
newnums = list(filter(lambda x: x >= 5, nums))
newnums

[5, 10, 100, 9, 24]

In [10]:
from random import shuffle
mylist = [3, 4, 8, 0, 5, 7, 6, 2, 1]
shuffle(mylist)
print(mylist)
shuffle(mylist)
print(mylist)

[8, 1, 3, 4, 2, 5, 0, 7, 6]
[5, 7, 8, 6, 1, 0, 4, 2, 3]

In [17]:
s='aaa bbb ccc ddd eee'

s1 = "".join(s.split())
print("s1 = ", s1)

s2 = str(''.join(([i for i in s if i!= " "])))
print("s2 = ", s2)

s3 = s1.replace(" ","")
print("s3 = ", s3)

s1 =  aaabbbcccdddeee
s2 =  aaabbbcccdddeee
s3 =  aaabbbcccdddeee

In [19]:
for i in map(lambda i: i**3,(2,3,7)):
    print(i)

8
27
343

In [23]:
x = ['ab','cd']
len(list(map(list,x)))

2

In [24]:
from functools import reduce
reduce(lambda x,y:x-y, [1,2,3,4,5])

-13

In [1]:
import pandas as pd
import numpy as np

data = {'Id':[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
        'Name':['Mark', 'Juli', 'Alexa', 'Kevin', 'John', 'Devid', 'Mark', 'Michael', 'Johnson', 'Kevin'],
        'Age':[27, 31, 45, np.nan, 34, 48, np.nan, 31, np.nan, 27],
        'Location':['USA', 'UK', np.nan, 'France', 'Germany', 'USA', 'Germany', np.nan, 'USA', 'Italy']}
df = pd.DataFrame(data)
df.head(10)

   Id     Name   Age Location
0   1     Mark  27.0      USA
1   2     Juli  31.0       UK
2   3    Alexa  45.0      NaN
3   4    Kevin   NaN   France
4   5     John  34.0  Germany
5   6    Devid  48.0      USA
6   7     Mark   NaN  Germany
7   8  Michael  31.0      NaN
8   9  Johnson   NaN      USA
9  10    Kevin  27.0    Italy

In [5]:
def count_unique_values(data):
    total = data.count()
    print(total)
    temp = pd.DataFrame(total)
    #print(temp)
    temp.columns = ['Total']
    
    uniques = []
    for col in data.columns:
        unique = data[col].nunique()
        uniques.append(unique)
    temp['Uniques'] = uniques
    print(temp)
    return(np.transpose(temp))

count_unique_values(df)

Id          10
Name        10
Age          7
Location     8
dtype: int64
          Total  Uniques
Id           10       10
Name         10        8
Age           7        5
Location      8        5

         Id  Name  Age  Location
Total    10    10    7         8
Uniques  10     8    5         5

In [8]:
df = pd.DataFrame({'name':['Huli', 'bee', 'Mark'], 'age':[1, 3, 3]})
df

   name  age
0  Huli    1
1   bee    3
2  Mark    3

In [9]:
df['name'].unique()

array(['Huli', 'bee', 'Mark'], dtype=object)

In [10]:
df['age'].unique()

array([1, 3], dtype=int64)

In [12]:
data = {'Student_Id':[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
        'Name':['Mark', 'Juli', 'Alexa', 'Kevin', 'John', 'Devid', 'Mark', 'Michael', 'Johnson', 'Kevin'],
        'Age':[27, 31, 45, np.nan, 34, 48, np.nan, 31, np.nan, 27],
        'Location':['USA', 'UK', np.nan, 'France', 'Germany', 'USA', 'Germany', np.nan, 'USA', 'Italy'],
        'Program':['Master','Master','Master','Master','Master','Master','Master','Master','Master','Master'] }
df = pd.DataFrame(data)
df.head(10)

   Student_Id     Name   Age Location Program
0           1     Mark  27.0      USA  Master
1           2     Juli  31.0       UK  Master
2           3    Alexa  45.0      NaN  Master
3           4    Kevin   NaN   France  Master
4           5     John  34.0  Germany  Master
5           6    Devid  48.0      USA  Master
6           7     Mark   NaN  Germany  Master
7           8  Michael  31.0      NaN  Master
8           9  Johnson   NaN      USA  Master
9          10    Kevin  27.0    Italy  Master

In [13]:
df['Name'].nunique()

8

In [14]:
df['Program'].nunique()

1

In [15]:
df['Location'].nunique()

5

In [17]:
def remove_constant_value_features(df):
    return [e for e in df.columns if df[e].nunique() == 1]

drop_col = remove_constant_value_features(df)
drop_col

['Program']

In [ ]:
#Drop Specific Columns

#df.drop(drop_col, axis = 1, inplace = True)
#new_df = df.drop(drop_col, axis=1)

In [18]:
data = {'Student_Id':[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
        'Name':['Mark', 'Juli', 'Alexa', 'Kevin', 'John', 'Devid', 'Mark', 'Michael', 'Johnson', 'Kevin'],
        'Age':[27, 31, 45, np.nan, 34, 48, np.nan, 31, np.nan, 27],
        'Location':['USA', 'UK', np.nan, 'France', 'Germany', 'USA', 'Germany', np.nan, 'USA', 'Italy']}
df = pd.DataFrame(data)
df.head(10)

   Student_Id     Name   Age Location
0           1     Mark  27.0      USA
1           2     Juli  31.0       UK
2           3    Alexa  45.0      NaN
3           4    Kevin   NaN   France
4           5     John  34.0  Germany
5           6    Devid  48.0      USA
6           7     Mark   NaN  Germany
7           8  Michael  31.0      NaN
8           9  Johnson   NaN      USA
9          10    Kevin  27.0    Italy

In [20]:
df.shape

(10, 4)

In [22]:
df.shape[0]

10

In [26]:
def remove_distinct_value_features(df):
    return [e for e in df.columns if df[e].nunique() == df.shape[0]]

drop_col = remove_distinct_value_features(df)
drop_col

['Student_Id']

In [27]:
pd.isnull(123)

False

pd.isnull(np.nan)

In [28]:
pd.isnull(np.nan)

True

In [29]:
pd.isnull(None)

True

In [30]:
df = pd.DataFrame([['abc', 'bee', np.nan], [1, None, 3]])
df

     0     1    2
0  abc   bee  NaN
1    1  None  3.0

In [31]:
pd.isnull(df)

       0      1      2
0  False  False   True
1  False   True  False

In [33]:
data = {'Student_Id':[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
        'Name':['Mark', 'Juli', 'Alexa', 'Kevin', 'John', 'Devid', 'Mark', 'Michael', 'Johnson', 'Kevin'],
        'Age':[27, 31, 45, np.nan, 34, 48, np.nan, 31, np.nan, 27],
        'Location':['USA', 'UK', np.nan, 'France', 'Germany', 'USA', 'Germany', np.nan, 'USA', 'Italy']}
df = pd.DataFrame(data)

def missing_data(data):
    total = data.isnull().sum()
    print(total)
    
    percent = (data.isnull().sum()/data.isnull().count()*100)
    print(percent)
    
    temp = pd.concat([total, percent], axis = 1, keys = ['Total', 'Percent(%)'])
    
    types = []
    for col in data.columns:
        dtype = str(data[col].dtype)
        types.append(dtype)
    temp['Types'] = types
    
    print(temp)
    return (np.transpose(temp))

missing_data(df)

Student_Id    0
Name          0
Age           3
Location      2
dtype: int64
Student_Id     0.0
Name           0.0
Age           30.0
Location      20.0
dtype: float64
            Total  Percent(%)    Types
Student_Id      0         0.0    int64
Name            0         0.0   object
Age             3        30.0  float64
Location        2        20.0   object

           Student_Id    Name      Age Location
Total               0       0        3        2
Percent(%)          0       0       30       20
Types           int64  object  float64   object

In [34]:
data = [['Mark','Test_1','Maths',75], ['Mark','Test_2','Science',85],
        ['Juli','Test_1','Physics',65],['Juli','Test_2','Maths',70],
        ['Kevin','Test_1','Science',80],['Kevin','Test_2','History',90]]
df = pd.DataFrame(data, columns=['Name','Test','Subject','Score'])
df

    Name    Test  Subject  Score
0   Mark  Test_1    Maths     75
1   Mark  Test_2  Science     85
2   Juli  Test_1  Physics     65
3   Juli  Test_2    Maths     70
4  Kevin  Test_1  Science     80
5  Kevin  Test_2  History     90

#DataFrame.set_index(self, keys, drop=True, append=False, inplace=False, verify_integrity=False)
keys - label or array-like or list of labels/arrays
drop - (default True) Delete columns to be used as the new index.
append - (default False) Whether to append columns to existing index.
inplace - (default False) Modify the DataFrame in place (do not create a new object).
verify_integrity - (default False) Check the new index for duplicates.

In [35]:
df.set_index(['Name'])

         Test  Subject  Score
Name
Mark   Test_1    Maths     75
Mark   Test_2  Science     85
Juli   Test_1  Physics     65
Juli   Test_2    Maths     70
Kevin  Test_1  Science     80
Kevin  Test_2  History     90

In [36]:
df.set_index(['Name', 'Test'])

              Subject  Score
Name  Test
Mark  Test_1    Maths     75
      Test_2  Science     85
Juli  Test_1  Physics     65
      Test_2    Maths     70
Kevin Test_1  Science     80
      Test_2  History     90

In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame([[None, np.nan, 8, np.inf], ['X','Y','','Z']], 
                  columns=['A','B','C','D'])
df

      A    B  C    D
0  None  NaN  8  inf
1     X    Y       Z

In [3]:
df.isna()

       A      B      C      D
0   True   True  False  False
1  False  False  False  False

In [4]:
df.notna()

       A      B     C     D
0  False  False  True  True
1   True   True  True  True

In [5]:
df['B'].notna()

0    False
1     True
Name: B, dtype: bool

In [6]:
pd.Series([1, 2, np.nan, 4])

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

In [7]:
s = pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [8]:
s[1] = None
s

0    10.0
1     NaN
2    30.0
dtype: float64

In [9]:
df = pd.DataFrame([[None, np.nan, 8, np.inf], ['X','Y','Q','Z']],
                  columns=['A','B','C','D'])
df

      A    B  C    D
0  None  NaN  8  inf
1     X    Y  Q    Z

In [10]:
df.fillna(0)

   A  B  C    D
0  0  0  8  inf
1  X  Y  Q    Z

In [11]:
df["B"].fillna("Missing")

0    Missing
1          Y
Name: B, dtype: object

In [12]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],[3, 4, np.nan, 1],[np.nan,np.nan,np.nan,5],
                   [np.nan, 3, np.nan, 4]], columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [13]:
df.fillna(method='ffill')

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

In [14]:
df.fillna(method='bfill')

     A    B   C  D
0  3.0  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  3.0 NaN  5
3  NaN  3.0 NaN  4